Catalogs/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Задачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрефиксВетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрефиксыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодробноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДорабатыватьКонфигурацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаBitrix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеткаGitLab</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВнешниеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обработка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыРазработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расширения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыРазработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыОбъектовРазработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ТипыОбъектовРазработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расширение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОбъектыРазработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ОбъектыРазработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаРазработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовРазработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТокенGitLab</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогРепозитория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенBitrix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогРепозиторияНаШаре</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяGitLab</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтаПользователяGitLab</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпрощенныйВыводЛогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Задачи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьФорму();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьСсылкуSonar();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИзBitrix(Команда)
	ОбновитьИзBitrixНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодборОбработок(Команда)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", Объект.Владелец);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииПодборОбработок", ЭтотОбъект, "Подбор");
	ОткрытьФорму("Справочник.ОбъектыРазработки.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОбработкаВыбора);

КонецПроцедуры

&НаКлиенте
Процедура СсылкаBitrixНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Объект.СсылкаBitrix);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаSonarНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(СсылкаSonar);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьИзBitrixНаСервере()
	
	НастройкиПользователя = Справочники.НастройкиПользователей.НастройкиТекущегоПользователя();
	ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
	Справочники.Задачи.ЗаполнитьДанныеЗадачи(ЗадачаОбъект, НастройкиПользователя, Неопределено, Истина);
	ЗначениеВРеквизитФормы(ЗадачаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииПодборОбработок(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Значение Цикл
		НайденныеСтроки = Объект.ВнешниеФайлы.НайтиСтроки(Новый Структура("Обработка", Элемент));
		Если Не НайденныеСтроки.Количество() Тогда
			НоваяСтрока = Объект.ВнешниеФайлы.Добавить();
			НоваяСтрока.Обработка = Элемент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НоваяОбработкаНаСервере(ИмяОбработки)
	
	//todo вынести в менеджер или модуль
	ПутьКШаблону = СтрШаблон("%1\Шаблоны\ШаблонОбработки.epf", НастройкиПользователя.КаталогРепозитория);
	ПутьКНовойОбработке =  СтрШаблон("%1\build\epf\%2.epf", НастройкиПользователя.КаталогРепозитория, ИмяОбработки);
	КопироватьФайл(ПутьКШаблону, ПутьКНовойОбработке);
	
	ОбработкаОбъект = Справочники.ОбъектыРазработки.СоздатьЭлемент();
	ОбработкаОбъект.УстановитьНовыйКод();
	ОбработкаОбъект.Владелец = НастройкиПользователя.Проект;
	ОбработкаОбъект.Наименование = ИмяОбработки;
	ОбработкаОбъект.ТипОбъектаРазработки = Перечисления.ТипыОбъектовРазработки.Обработка;
	ОбработкаОбъект.Версия = Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMdd");
	ОбработкаОбъект.Записать();

	Обработка = ОбработкаОбъект.Ссылка;
	
	СтрокаВнешнихФайлов = Объект.ВнешниеФайлы.Добавить();
	СтрокаВнешнихФайлов.Обработка = Обработка;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура НоваяОбработка(Команда)
	
	НазваниеОбработки = "";
	
	Обещание = ВвестиСтрокуАсинх(НазваниеОбработки, НСтр("ru='Введите название обработки'"));
	ИмяОбработки = Ждать Обещание;
	Если ЗначениеЗаполнено(ИмяОбработки) Тогда
		НоваяОбработкаНаСервере(ИмяОбработки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработки(Команда)
	
	//todo Открывать шару
	ПутьКНовойОбработке = СтрШаблон("%1\build\epf", НастройкиПользователя.КаталогРепозиторияНаШаре);
	ЗапуститьПриложение(ПутьКНовойОбработке);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
	НастройкиПользователя = Справочники.НастройкиПользователей.НастройкиТекущегоПользователя();
КонецПроцедуры

&НаСервере
Процедура УстановитьСсылкуSonar()
	ШаблонСсылкиSonar = ШаблонСсылкиSonar();
	СсылкаSonar = СтрШаблон(ШаблонСсылкиSonar, Объект.ИмяВетки, Нрег(Объект.Владелец)); 	
КонецПроцедуры

&НаСервере
Функция ШаблонСсылкиSonar()
	Возврат "http://gitlabprojects.toolsworld.root.local:9000/dashboard?branch=feature/%1&id=%2";
КонецФункции

#КонецОбласти
